Revit 2027 API
RebarSpliceRules.SetMaximumAndMinimumBarLength Method
 Sets the maximum and minimum bar length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMaximumAndMinimumBarLength(
	double maximumBarLength,
	double minimumBarLength
)
Public Sub SetMaximumAndMinimumBarLength (
	maximumBarLength As Double,
	minimumBarLength As Double
)
public:
void SetMaximumAndMinimumBarLength(
	double maximumBarLength,
	double minimumBarLength
)
member SetMaximumAndMinimumBarLength :
        maximumBarLength : float *
        minimumBarLength : float -> unit
Parameters
maximumBarLength Double
 The maximum bar length.
minimumBarLength Double
 The minimum bar length.
Exceptions
Exception | Condition
ArgumentException |  The maximum bar length should be greater or almost equal to the minimum bar length.
ArgumentOutOfRangeException |  The given value for minimumBarLength must be between 0 and 30000 feet.
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace